app/views/rooms/join_hub.html.erb

<%if  current_user.repcode ==nil %>
  <%if User.where.not(session_id: nil).last %>
---
SELECT  "users".* FROM "users" WHERE ("users"."session_id" IS NOT NULL)  ORDER BY "users"."id" DESC LIMIT 1