app/controllers/rooms_controller.rb

UPDATE "users" SET "token" = $1, "session_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4
---
  def create_sesh
    @opentok = OpenTok::OpenTok.new Rails.application.secrets.ot_api_key, Rails.application.secrets.ot_api_secret
    @session = @opentok.create_session :media_mode => :routed
    @session_id = @session.session_id
    @token = @session.generate_token

    current_user.token = @session.generate_token

    current_user.session_id = @session_id
    current_user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 2]]
---
  def join_sesh
      chosen_user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE ("users"."session_id" IS NOT NULL)  ORDER BY "users"."id" DESC LIMIT 1
---
  def join_hub
    # @list1 = User.order(updated_at: :asc)
    if User.where.not(session_id: nil).last