app/controllers/users_controller.rb

  def create_sesh
    @opentok = OpenTok::OpenTok.new 45507072, "dee03bbe56d0e633306e6293b9bf69e97d3e8e10"
    @session = @opentok.create_session :archive_mode => :always, :media_mode => :routed
    @session_id = @session.session_id
    @token = @session.generate_token

    current_user.token = @session.generate_token

    current_user.session_id = @session_id
    current_user.save
---
UPDATE "users" SET "token" = $1, "session_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4

  def show
    current_user.session_id = nil
    current_user.save
---
UPDATE "users" SET "session_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_id", nil], ["updated_at", "2016-02-29 23:01:22.506398"], ["id", 1]]

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "repcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    session[:user_id] = nil
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]